<div class="footer flex gap">

    <div class="footer__column flex dir-col gap">
        <h6>Какой-то столбец 1</h6>
        <a href="#">Какой-то столбец 1, какая-то строка 1</a>
        <a href="#">Какой-то столбец 1, какая-то строка 2</a>
        <a href="#">Какой-то столбец 1, какая-то строка 3</a>
    </div>
    <div class="footer__column flex dir-col gap">
        <h6>Какой-то столбец 2</h6>
        <a href="#">Какой-то столбец 2, какая-то строка 1</a>
        <a href="#">Какой-то столбец 2, какая-то строка 2</a>
        <a href="#">Какой-то столбец 2, какая-то строка 3</a>
    </div>
    <div class="footer__column flex dir-col gap">
        <h6>Какой-то столбец 3</h6>
        <a href="#">Какой-то столбец 3, какая-то строка 1</a>
        <a href="#">Какой-то столбец 3, какая-то строка 2</a>
        <a href="#">Какой-то столбец 3, какая-то строка 3</a>
    </div>
    <div class="footer__column flex dir-col gap">
        <h6>Какой-то столбец 4</h6>
        <a href="#">Какой-то столбец 4, какая-то строка 1</a>
        <a href="#">Какой-то столбец 4, какая-то строка 2</a>
        <a href="#">Какой-то столбец 4, какая-то строка 3</a>
    </div>
</div>